tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1847_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1847_H_
#define _PIC16F1847_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PIR1                          53
#define TMR1IF                        54
#define TMR2IF                        55
#define CCP1IF                        56
#define SSP1IF                        57
#define TXIF                          58
#define RCIF                          59
#define ADIF                          60
#define TMR1GIF                       61
#define PIR2                          62
#define CCP2IF                        63
#define BCL1IF                        64
#define EEIF                          65
#define C1IF                          66
#define C2IF                          67
#define OSFIF                         68
#define PIR3                          69
#define TMR4IF                        70
#define TMR6IF                        71
#define CCP3IF                        72
#define CCP4IF                        73
#define PIR4                          74
#define SSP2IF                        75
#define BCL2IF                        76
#define TMR0                          77
#define TMR1L                         78
#define TMR1H                         79
#define T1CON                         80
#define TMR1ON                        81
#define nT1SYNC                       82
#define T1OSCEN                       83
#define T1CKPS0                       84
#define T1CKPS                        85
#define T1CKPS1                       86
#define TMR1CS                        87
#define TMR1CS0                       88
#define TMR1CS1                       89
#define T1GCON                        90
#define T1GSS0                        91
#define T1GSS                         92
#define T1GSS1                        93
#define T1GVAL                        94
#define T1GGO_nDONE                   95
#define T1GGO                         96
#define T1GSPM                        97
#define T1GTM                         98
#define T1GPOL                        99
#define TMR1GE                        100
#define TMR2                          101
#define PR2                           102
#define T2CON                         103
#define T2CKPS0                       104
#define T2CKPS                        105
#define T2CKPS1                       106
#define TMR2ON                        107
#define T2OUTPS0                      108
#define T2OUTPS                       109
#define T2OUTPS1                      110
#define T2OUTPS2                      111
#define T2OUTPS3                      112
#define CPSCON0                       113
#define T0XCS                         114
#define CPSOUT                        115
#define CPSRNG                        116
#define CPSRNG0                       117
#define CPSRNG1                       118
#define CPSRM                         119
#define CPSON                         120
#define CPSCON1                       121
#define CPSCH                         122
#define CPSCH0                        123
#define CPSCH1                        124
#define CPSCH2                        125
#define CPSCH3                        126
#define TRISA                         127
#define TRISA0                        128
#define TRISA1                        129
#define TRISA2                        130
#define TRISA3                        131
#define TRISA4                        132
#define TRISA5                        133
#define TRISA6                        134
#define TRISA7                        135
#define TRISB                         136
#define TRISB0                        137
#define TRISB1                        138
#define TRISB2                        139
#define TRISB3                        140
#define TRISB4                        141
#define TRISB5                        142
#define TRISB6                        143
#define TRISB7                        144
#define PIE1                          145
#define TMR1IE                        146
#define TMR2IE                        147
#define CCP1IE                        148
#define SSP1IE                        149
#define TXIE                          150
#define RCIE                          151
#define ADIE                          152
#define TMR1GIE                       153
#define PIE2                          154
#define CCP2IE                        155
#define BCL1IE                        156
#define EEIE                          157
#define C1IE                          158
#define C2IE                          159
#define OSFIE                         160
#define PIE3                          161
#define TMR4IE                        162
#define TMR6IE                        163
#define CCP3IE                        164
#define CCP4IE                        165
#define PIE4                          166
#define SSP2IE                        167
#define BCL2IE                        168
#define OPTION_REG                    169
#define PS                            170
#define PS0                           171
#define PS1                           172
#define PS2                           173
#define PSA                           174
#define T0SE                          175
#define TMR0SE                        176
#define T0CS                          177
#define TMR0CS                        178
#define INTEDG                        179
#define nWPUEN                        180
#define PCON                          181
#define nBOR                          182
#define nPOR                          183
#define nRI                           184
#define nRMCLR                        185
#define STKUNF                        186
#define STKOVF                        187
#define WDTCON                        188
#define SWDTEN                        189
#define WDTPS                         190
#define WDTPS0                        191
#define WDTPS1                        192
#define WDTPS2                        193
#define WDTPS3                        194
#define WDTPS4                        195
#define OSCTUNE                       196
#define TUN0                          197
#define TUN                           198
#define TUN1                          199
#define TUN2                          200
#define TUN3                          201
#define TUN4                          202
#define TUN5                          203
#define OSCCON                        204
#define SCS0                          205
#define SCS                           206
#define SCS1                          207
#define IRCF                          208
#define IRCF0                         209
#define IRCF1                         210
#define IRCF2                         211
#define IRCF3                         212
#define SPLLEN                        213
#define OSCSTAT                       214
#define HFIOFS                        215
#define LFIOFR                        216
#define MFIOFR                        217
#define HFIOFL                        218
#define HFIOFR                        219
#define OSTS                          220
#define PLLR                          221
#define T1OSCR                        222
#define ADRESL                        223
#define ADRESH                        224
#define ADCON0                        225
#define ADON                          226
#define GO_nDONE                      227
#define GO                            228
#define ADGO                          229
#define CHS0                          230
#define CHS                           231
#define CHS1                          232
#define CHS2                          233
#define CHS3                          234
#define CHS4                          235
#define ADCON1                        236
#define ADPREF0                       237
#define ADPREF                        238
#define ADPREF1                       239
#define ADNREF                        240
#define ADCS0                         241
#define ADCS                          242
#define ADCS1                         243
#define ADCS2                         244
#define ADFM                          245
#define LATA                          246
#define LATA0                         247
#define LATA1                         248
#define LATA2                         249
#define LATA3                         250
#define LATA4                         251
#define LATA6                         252
#define LATA7                         253
#define LATB                          254
#define LATB0                         255
#define LATB1                         256
#define LATB2                         257
#define LATB3                         258
#define LATB4                         259
#define LATB5                         260
#define LATB6                         261
#define LATB7                         262
#define CM1CON0                       263
#define C1SYNC                        264
#define C1HYS                         265
#define C1SP                          266
#define C1POL                         267
#define C1OE                          268
#define C1OUT                         269
#define C1ON                          270
#define CM1CON1                       271
#define C1NCH0                        272
#define C1NCH                         273
#define C1NCH1                        274
#define C1PCH                         275
#define C1PCH0                        276
#define C1PCH1                        277
#define C1INTN                        278
#define C1INTP                        279
#define CM2CON0                       280
#define C2SYNC                        281
#define C2HYS                         282
#define C2SP                          283
#define C2POL                         284
#define C2OE                          285
#define C2OUT                         286
#define C2ON                          287
#define CM2CON1                       288
#define C2NCH0                        289
#define C2NCH                         290
#define C2NCH1                        291
#define C2PCH                         292
#define C2PCH0                        293
#define C2PCH1                        294
#define C2INTN                        295
#define C2INTP                        296
#define CMOUT                         297
#define MC1OUT                        298
#define MC2OUT                        299
#define BORCON                        300
#define BORRDY                        301
#define SBOREN                        302
#define FVRCON                        303
#define ADFVR0                        304
#define ADFVR                         305
#define ADFVR1                        306
#define CDAFVR0                       307
#define CDAFVR                        308
#define CDAFVR1                       309
#define TSRNG                         310
#define TSEN                          311
#define FVRRDY                        312
#define FVREN                         313
#define DACCON0                       314
#define DACNSS                        315
#define DACPSS                        316
#define DACPSS0                       317
#define DACPSS1                       318
#define DACOE                         319
#define DACLPS                        320
#define DACEN                         321
#define DACCON1                       322
#define DACR0                         323
#define DACR                          324
#define DACR1                         325
#define DACR2                         326
#define DACR3                         327
#define DACR4                         328
#define SRCON0                        329
#define SRPR                          330
#define SRPS                          331
#define SRNQEN                        332
#define SRQEN                         333
#define SRCLK0                        334
#define SRCLK                         335
#define SRCLK1                        336
#define SRCLK2                        337
#define SRLEN                         338
#define SRCON1                        339
#define SRRC1E                        340
#define SRRC2E                        341
#define SRRCKE                        342
#define SRRPE                         343
#define SRSC1E                        344
#define SRSC2E                        345
#define SRSCKE                        346
#define SRSPE                         347
#define APFCON0                       348
#define CCP1SEL                       349
#define P1CSEL                        350
#define P1DSEL                        351
#define CCP2SEL                       352
#define P2BSEL                        353
#define SS1SEL                        354
#define SDO1SEL                       355
#define RXDTSEL                       356
#define APFCON1                       357
#define TXCKSEL                       358
#define ANSA0                         359
#define ANSELA                        360
#define ANSA1                         361
#define ANSA2                         362
#define ANSA3                         363
#define ANSA4                         364
#define ANSELB                        365
#define ANSB1                         366
#define ANSB2                         367
#define ANSB3                         368
#define ANSB4                         369
#define ANSB5                         370
#define ANSB6                         371
#define ANSB7                         372
#define EEADRL                        373
#define EEADRH                        374
#define EEDATL                        375
#define EEDATH                        376
#define EECON1                        377
#define RD                            378
#define WR                            379
#define WREN                          380
#define WRERR                         381
#define FREE                          382
#define LWLO                          383
#define CFGS                          384
#define EEPGD                         385
#define EECON2                        386
#define RCREG                         387
#define TXREG                         388
#define SP1BRGL                       389
#define SPBRGL                        390
#define SP1BRGH                       391
#define SPBRGH                        392
#define RCSTA                         393
#define RX9D                          394
#define OERR                          395
#define FERR                          396
#define ADDEN                         397
#define CREN                          398
#define SREN                          399
#define RX9                           400
#define SPEN                          401
#define TXSTA                         402
#define TX9D                          403
#define TRMT                          404
#define BRGH                          405
#define SENDB                         406
#define SYNC                          407
#define TXEN                          408
#define TX9                           409
#define CSRC                          410
#define BAUDCON                       411
#define ABDEN                         412
#define WUE                           413
#define BRG16                         414
#define SCKP                          415
#define RCIDL                         416
#define ABDOVF                        417
#define WPUA                          418
#define WPUA5                         419
#define WPUB0                         420
#define WPUB                          421
#define WPUB1                         422
#define WPUB2                         423
#define WPUB3                         424
#define WPUB4                         425
#define WPUB5                         426
#define WPUB6                         427
#define WPUB7                         428
#define SSP1BUF                       429
#define SSP1BUF_SSPBUF                430
#define SSP1ADD                       431
#define SSP1ADD_SSPADD                432
#define SSP1MSK                       433
#define SSP1MSK_SSPMSK                434
#define SSP1STAT                      435
#define SSP1STAT_BF                   436
#define SSP1STAT_UA                   437
#define SSP1STAT_R_nW                 438
#define SSP1STAT_S                    439
#define SSP1STAT_P                    440
#define SSP1STAT_D_nA                 441
#define SSP1STAT_CKE                  442
#define SSP1STAT_SMP                  443
#define SSP1CON1                      444
#define SSP1CON1_SSPM                 445
#define SSP1CON1_SSPM0                446
#define SSP1CON1_SSPM1                447
#define SSP1CON1_SSPM2                448
#define SSP1CON1_SSPM3                449
#define SSP1CON1_CKP                  450
#define SSP1CON1_SSPEN                451
#define SSP1CON1_SSPOV                452
#define SSP1CON1_WCOL                 453
#define SSP1CON2                      454
#define SSP1CON2_SEN                  455
#define SSP1CON2_RSEN                 456
#define SSP1CON2_PEN                  457
#define SSP1CON2_RCEN                 458
#define SSP1CON2_ACKEN                459
#define SSP1CON2_ACKDT                460
#define SSP1CON2_ACKSTAT              461
#define SSP1CON2_GCEN                 462
#define SSP1CON3                      463
#define SSP1CON3_DHEN                 464
#define SSP1CON3_AHEN                 465
#define SSP1CON3_SBCDE                466
#define SSP1CON3_SDAHT                467
#define SSP1CON3_BOEN                 468
#define SSP1CON3_SCIE                 469
#define SSP1CON3_PCIE                 470
#define SSP1CON3_ACKTIM               471
#define SSP2BUF                       472
#define SSP2BUF_SSPBUF                473
#define SSP2ADD                       474
#define SSP2ADD_SSPADD                475
#define SSP2MSK                       476
#define SSP2MSK_SSPMSK                477
#define SSP2STAT                      478
#define SSP2STAT_BF                   479
#define SSP2STAT_UA                   480
#define SSP2STAT_R_nW                 481
#define SSP2STAT_S                    482
#define SSP2STAT_P                    483
#define SSP2STAT_D_nA                 484
#define SSP2STAT_CKE                  485
#define SSP2STAT_SMP                  486
#define SSP2CON1                      487
#define SSP2CON1_SSPM                 488
#define SSP2CON1_SSPM0                489
#define SSP2CON1_SSPM1                490
#define SSP2CON1_SSPM2                491
#define SSP2CON1_SSPM3                492
#define SSP2CON1_CKP                  493
#define SSP2CON1_SSPEN                494
#define SSP2CON1_SSPOV                495
#define SSP2CON1_WCOL                 496
#define SSP2CON2                      497
#define SSP2CON2_SEN                  498
#define SSP2CON2_RSEN                 499
#define SSP2CON2_PEN                  500
#define SSP2CON2_RCEN                 501
#define SSP2CON2_ACKEN                502
#define SSP2CON2_ACKDT                503
#define SSP2CON2_ACKSTAT              504
#define SSP2CON2_GCEN                 505
#define SSP2CON3                      506
#define SSP2CON3_DHEN                 507
#define SSP2CON3_AHEN                 508
#define SSP2CON3_SBCDE                509
#define SSP2CON3_SDAHT                510
#define SSP2CON3_BOEN                 511
#define SSP2CON3_SCIE                 512
#define SSP2CON3_PCIE                 513
#define SSP2CON3_ACKTIM               514
#define CCPR1L                        515
#define CCPR1H                        516
#define CCP1CON                       517
#define CCP1M0                        518
#define CCP1M                         519
#define CCP1M1                        520
#define CCP1M2                        521
